Revit 2024 API
View.IsAssemblyView Property
 Indicates if the view is assembly view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsAssemblyView { get; }
Visual Basic
Public ReadOnly Property IsAssemblyView As Boolean
	Get
Visual C++
public:
property bool IsAssemblyView {
	bool get ();
}
See Also
View Class
Autodesk.Revit.DB Namespace